app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "The first S"], ["description", "Stronger"], ["updated_at", "2018-02-04 23:17:32.021836"], ["id", 4]]
---
	def update
		post = Post.find(params[:id])
		post.update(title: params[:title], description: params[:description])